Revit 2025 API
RailIndex Enumeration
 The continuous rail position index.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum RailIndex
Public Enumeration RailIndex
public enum class RailIndex
type RailIndex
Members
Member name | Value | Description
Top | 0 |  The rail is located on the top of the railing.
LeftPrimary | 1 |  The rail is a primary rail on the left.
RightPrimary | 2 |  The rail is a primary rail on the right.
LeftSecondary | 3 |  The rail is a secondary rail on the left.
RightSecondary | 4 |  The rail is a secondary rail on the right.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace